In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Clean Sheet - CustomerDemographic

In [2]:
customer_demographic_df = pd.read_excel(io='KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='CustomerDemographic')

In [3]:
customer_demographic_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [4]:
customer_demographic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
customer_id                            4000 non-null int64
first_name                             4000 non-null object
last_name                              3875 non-null object
gender                                 4000 non-null object
past_3_years_bike_related_purchases    4000 non-null int64
DOB                                    3913 non-null datetime64[ns]
job_title                              3494 non-null object
job_industry_category                  3344 non-null object
wealth_segment                         4000 non-null object
deceased_indicator                     4000 non-null object
default                                3698 non-null object
owns_car                               4000 non-null object
tenure                                 3913 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [5]:
# <<--- Clean Gender Column --->>

In [6]:
customer_demographic_df.gender.unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [7]:
customer_demographic_df['gender'].replace(to_replace={'Femal':'F', 'Female':'F', 'Male':'M'}, inplace=True)

In [8]:
# <<--- Remove default Column --->>

In [9]:
customer_demographic_df.drop(labels='default', axis=1, inplace=True)

In [10]:
# <<--- Filter the people that are only alive by the help of deceased_indicator columns --->>

In [11]:
filter_mask = (customer_demographic_df['deceased_indicator'] == 'N')
customer_demographic_df = customer_demographic_df[filter_mask]

In [12]:
# <<-- Make Age Column -->>

In [13]:
import datetime
customer_demographic_df['Age'] = [datetime.date.today().year - date.year if type(date) == pd._libs.tslibs.timestamps.Timestamp else np.nan for date in customer_demographic_df['DOB']]

In [14]:
# sorted(customer_demographic_df['Age'].unique())

In [15]:
# <<--- Remove invalid ages ie 177yrs --->>

In [16]:
customer_demographic_df = customer_demographic_df[customer_demographic_df['Age'] != 177]

In [17]:
customer_demographic_df.to_excel(excel_writer='CustomerDemographic.xlsx')

In [18]:
customer_demographic_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,67.0
1,2,Eli,Bockman,M,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,40.0
2,3,Arlin,Dearle,M,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,66.0
3,4,Talbot,NaN,M,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,59.0
4,5,Sheila-kathryn,Calton,F,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,43.0

In [19]:
customer_demographic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3997 entries, 0 to 3999
Data columns (total 13 columns):
customer_id                            3997 non-null int64
first_name                             3997 non-null object
last_name                              3872 non-null object
gender                                 3997 non-null object
past_3_years_bike_related_purchases    3997 non-null int64
DOB                                    3910 non-null datetime64[ns]
job_title                              3491 non-null object
job_industry_category                  3341 non-null object
wealth_segment                         3997 non-null object
deceased_indicator                     3997 non-null object
owns_car                               3997 non-null object
tenure                                 3910 non-null float64
Age                                    3910 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(8)
memory usage: 437.2+ KB

# Clean Sheet - CustomerAddress

In [20]:
customer_address_df = pd.read_excel(io='KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='CustomerAddress')

In [21]:
customer_address_df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [22]:
customer_address_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
customer_id           3999 non-null int64
address               3999 non-null object
postcode              3999 non-null int64
state                 3999 non-null object
country               3999 non-null object
property_valuation    3999 non-null int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [23]:
customer_address_df['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [24]:
# <<--- Handle Inconsistent States --->>

In [25]:
customer_address_df.replace(to_replace={'NSW':'New South Wales', 'VIC':'Victoria', 'QLD': 'Queensland'}, inplace=True)

In [26]:
customer_address_df.to_excel(excel_writer='CustomerAddress.xlsx')

In [27]:
customer_address_df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,Queensland,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,Victoria,Australia,9

In [28]:
customer_address_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
customer_id           3999 non-null int64
address               3999 non-null object
postcode              3999 non-null int64
state                 3999 non-null object
country               3999 non-null object
property_valuation    3999 non-null int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

#  Clean Sheet - Transactions

In [29]:
transactions_df = pd.read_excel(io='KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='Transactions')

In [30]:
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [31]:
transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
transaction_id             20000 non-null int64
product_id                 20000 non-null int64
customer_id                20000 non-null int64
transaction_date           20000 non-null datetime64[ns]
online_order               19640 non-null float64
order_status               20000 non-null object
brand                      19803 non-null object
product_line               19803 non-null object
product_class              19803 non-null object
product_size               19803 non-null object
list_price                 20000 non-null float64
standard_cost              19803 non-null float64
product_first_sold_date    19803 non-null float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [32]:
# <<--- Convert online_order from 0.0, 1.1 to False, True respectivly --->>>

In [33]:
transactions_df['online_order'].replace(to_replace={0.0: False, 1.0:True}, inplace=True)

In [34]:
# <<--- Remove the customers that do not have brand they bought --->>

In [35]:
transactions_df.dropna(axis=0, subset=['brand'], inplace=True)

In [36]:
# transactions_df.info()

In [37]:
transactions_df['order_status'].unique()

array(['Approved', 'Cancelled'], dtype=object)

In [38]:
# <<-- Include only approved transactions -->>

In [39]:
filter_mask = (transactions_df['order_status'] == 'Approved')
transactions_df = transactions_df[filter_mask]

In [40]:
# <<<---- Add profit column ---->>>

In [41]:
transactions_df['Profit'] = transactions_df['list_price'] - transactions_df['standard_cost']

In [42]:
# <<--- Bring date to their propper format -->>

In [43]:
from datetime import date, timedelta

start_date = date(1899, 12, 30)  # excel start date

new_dates = [start_date + timedelta(days=days) for days in transactions_df['product_first_sold_date']]
transactions_df['product_first_sold_date'] = new_dates

In [44]:
transactions_df.to_excel(excel_writer='Transactions.xlsx')

In [45]:
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,Profit
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62,2012-12-02,17.87
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,2014-03-03,1702.55
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1999-07-20,1544.61
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,1998-12-16,817.36
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,2015-08-10,1055.82

In [46]:
transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19625 entries, 0 to 19999
Data columns (total 14 columns):
transaction_id             19625 non-null int64
product_id                 19625 non-null int64
customer_id                19625 non-null int64
transaction_date           19625 non-null datetime64[ns]
online_order               19273 non-null object
order_status               19625 non-null object
brand                      19625 non-null object
product_line               19625 non-null object
product_class              19625 non-null object
product_size               19625 non-null object
list_price                 19625 non-null float64
standard_cost              19625 non-null float64
product_first_sold_date    19625 non-null object
Profit                     19625 non-null float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(7)
memory usage: 2.2+ MB